import pandas as pd


df = pd.read_csv("../../data/中国大学综合排名.csv")
"""
    排名  升/降      学校名称  ...  学术人才 重大项目与成果 国际竞争力
0    1    0      清华大学  ...  90.8   129.1  80.1
1    2    0      北京大学  ...  92.6   102.9  59.2
2    3    0      浙江大学  ...  67.7    79.4  42.9
3    4    0    上海交通大学  ...  65.1    86.8  39.2
4    5    0      南京大学  ...  61.2    72.0  30.4
5    6    0      复旦大学  ...  65.0    60.1  37.6
6    7    0  中国科学技术大学  ...  58.6    46.6  42.1
7    8    0    华中科技大学  ...  35.2    45.2  31.3
8    9    0      武汉大学  ...  35.0    43.0  25.7
9   10    1    西安交通大学  ...  26.2    46.5  24.6
10  11    1   哈尔滨工业大学  ...  23.7    35.8  25.8
11  12   -2      中山大学  ...  37.8    31.4  33.3
12  13    1    北京师范大学  ...  33.2    39.0  29.4
13  14    2      四川大学  ...  28.0    35.4  23.1
14  15   -2  北京航空航天大学  ...  26.7    54.7  23.8
15  16   -1      同济大学  ...  29.1    35.0  22.1
16  17    0      东南大学  ...  20.1    36.2  25.8
17  18    0    中国人民大学  ...  31.8    42.6  15.8
18  19    1    北京理工大学  ...  19.2    40.5  24.0
19  20   -1      南开大学  ...  29.1    27.3  24.9

[20 rows x 17 columns]
"""
print(df)

"""
             排名        升/降          总分  ...       学术人才     重大项目与成果      国际竞争力
count  20.00000  20.000000   20.000000  ...  20.000000   20.000000  20.000000
mean   10.50000   0.000000  594.615000  ...  43.805000   54.475000  33.055000
std     5.91608   0.973329  137.122117  ...  22.809497   26.689992  14.760098
min     1.00000  -2.000000  465.300000  ...  19.200000   27.300000  15.800000
25%     5.75000   0.000000  512.425000  ...  27.675000   36.100000  24.450000
50%    10.50000   0.000000  530.250000  ...  34.100000   44.100000  27.600000
75%    15.25000   0.250000  650.975000  ...  62.150000   63.075000  38.000000
max    20.00000   2.000000  969.200000  ...  92.600000  129.100000  80.100000

[8 rows x 13 columns]
"""
print(df.describe())
"""
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 17 columns):
 #   Column   Non-Null Count  Dtype  
---  ------   --------------  -----  
 0   排名       20 non-null     int64  
 1   升/降      20 non-null     int64  
 2   学校名称     20 non-null     object 
 3   英文名称     20 non-null     object 
 4   省市       20 non-null     object 
 5   类型       20 non-null     object 
 6   总分       20 non-null     float64
 7   办学层次     20 non-null     float64
 8   学科水平     20 non-null     float64
 9   办学资源     20 non-null     float64
 10  师资规模与结构  20 non-null     float64
 11  人才培养     20 non-null     float64
 12  科学研究     20 non-null     float64
 13  服务社会     20 non-null     float64
 14  学术人才     20 non-null     float64
 15  重大项目与成果  20 non-null     float64
 16  国际竞争力    20 non-null     float64
dtypes: float64(11), int64(2), object(4)
memory usage: 2.8+ KB
None
"""
print(df.info())


df.dropna(inplace=True)
df.drop_duplicates(inplace=True)
df["重大项目与成果"].astype(int)
"""
    排名  升/降      学校名称  ...  学术人才 重大项目与成果 国际竞争力
0    1    0      清华大学  ...  90.8   129.1  80.1
1    2    0      北京大学  ...  92.6   102.9  59.2
2    3    0      浙江大学  ...  67.7    79.4  42.9
3    4    0    上海交通大学  ...  65.1    86.8  39.2
4    5    0      南京大学  ...  61.2    72.0  30.4
5    6    0      复旦大学  ...  65.0    60.1  37.6
6    7    0  中国科学技术大学  ...  58.6    46.6  42.1
7    8    0    华中科技大学  ...  35.2    45.2  31.3
8    9    0      武汉大学  ...  35.0    43.0  25.7
9   10    1    西安交通大学  ...  26.2    46.5  24.6
10  11    1   哈尔滨工业大学  ...  23.7    35.8  25.8
11  12   -2      中山大学  ...  37.8    31.4  33.3
12  13    1    北京师范大学  ...  33.2    39.0  29.4
13  14    2      四川大学  ...  28.0    35.4  23.1
14  15   -2  北京航空航天大学  ...  26.7    54.7  23.8
15  16   -1      同济大学  ...  29.1    35.0  22.1
16  17    0      东南大学  ...  20.1    36.2  25.8
17  18    0    中国人民大学  ...  31.8    42.6  15.8
18  19    1    北京理工大学  ...  19.2    40.5  24.0
19  20   -1      南开大学  ...  29.1    27.3  24.9

[20 rows x 17 columns]
"""
print(df)

mean_data=df["重大项目与成果"].mean()
"""
54.475
"""
print(mean_data)

import  matplotlib.pyplot as plt

df["重大项目与成果"].hist()
plt.show()